djgreeb/XDJ-X/Mixer assy/FW_BACKUP/XDJX_MIXER_ASSY_028/XDJX_MIXER_ASSY/ROTARY_MIXER.ioc
SAI3.OutputDrive-SAI_A_SyncSlave=SAI_OUTPUTDRIVE_ENABLE
SAI3.OutputDrive-SAI_B_SyncSlave=SAI_OUTPUTDRIVE_ENABLE
SAI3.SlotActive-SAI_A_SyncSlave=0x00000003
SAI3.SlotActive-SAI_B_SyncSlave=0x00000003
SAI3.SlotNumber-SAI_A_SyncSlave=2
SAI3.SlotNumber-SAI_B_SyncSlave=2
SAI3.Synchro_A=SAI_SYNCHRONOUS_EXT_SAI1
SAI3.VirtualMode-SAI_A_SyncSlave=VM_SLAVE
SAI3.VirtualMode-SAI_B_SyncSlave=VM_SLAVE
SAI3.VirtualSlotActive-SAI_A_SyncSlave=SAI_SLOT_USERSETTING
SAI3.VirtualSlotActive-SAI_B_SyncSlave=SAI_SLOT_USERSETTING
SAI3.VirtualSlotActive0-SAI_A_SyncSlave=true
SAI3.VirtualSlotActive0-SAI_B_SyncSlave=true
SAI3.VirtualSlotActive1-SAI_A_SyncSlave=true
SAI3.VirtualSlotActive1-SAI_B_SyncSlave=true
SH.ADCx_INP18.0=ADC2_INP18,IN18-Single-Ended
SH.ADCx_INP18.ConfNb=1
SH.ADCx_INP19.0=ADC1_INP19,IN19-Single-Ended
SH.ADCx_INP19.ConfNb=1
SH.S_TIM3_CH2.0=TIM3_CH2,PWM Generation2 CH2
SH.S_TIM3_CH2.ConfNb=1
SH.S_TIM8_CH1.0=TIM8_CH1,Encoder_Interface
SH.S_TIM8_CH1.ConfNb=1
SH.S_TIM8_CH2.0=TIM8_CH2,Encoder_Interface
SH.S_TIM8_CH2.ConfNb=1
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_8
SPI1.CalculateBaudRate=24.0 MBits/s
SPI1.DataSize=SPI_DATASIZE_8BIT
SPI1.Direction=SPI_DIRECTION_2LINES_TXONLY
SPI1.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate,DataSize,MasterKeepIOState
SPI1.MasterKeepIOState=SPI_MASTER_KEEP_IO_STATE_ENABLE
SPI1.Mode=SPI_MODE_MASTER
SPI1.VirtualType=VM_MASTER
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_8
SPI2.CalculateBaudRate=24.0 MBits/s
SPI2.DataSize=SPI_DATASIZE_16BIT
SPI2.Direction=SPI_DIRECTION_2LINES_TXONLY
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,DataSize,BaudRatePrescaler,NSSPMode,MasterKeepIOState
SPI2.MasterKeepIOState=SPI_MASTER_KEEP_IO_STATE_ENABLE
SPI2.Mode=SPI_MODE_MASTER
SPI2.NSSPMode=SPI_NSS_PULSE_ENABLE
SPI2.VirtualType=VM_MASTER
TIM2.ClockDivision=TIM_CLOCKDIVISION_DIV2
TIM2.IPParameters=Prescaler,Period,ClockDivision
TIM2.Period=999
TIM2.Prescaler=99
TIM3.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
TIM3.ClockDivision=TIM_CLOCKDIVISION_DIV4
TIM3.IPParameters=Channel-PWM Generation2 CH2,Prescaler,ClockDivision,Period
TIM3.Period=999
TIM3.Prescaler=239
TIM8.EncoderMode=TIM_ENCODERMODE_TI1
TIM8.IC1Filter=5
TIM8.IC2Filter=5
TIM8.IPParameters=IC1Filter,IC2Filter,EncoderMode
USART1.BaudRate=31250
USART1.IPParameters=VirtualMode-Asynchronous,Mode,BaudRate
USART1.Mode=MODE_RX
USART1.VirtualMode-Asynchronous=VM_ASYNC
VP_SAI1_VP_$IpInstance_SYNCHRO_EXTERNAL.Mode=SynchroExternal
VP_SAI1_VP_$IpInstance_SYNCHRO_EXTERNAL.Signal=SAI1_VP_$IpInstance_SYNCHRO_EXTERNAL
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM2_VS_ClockSourceINT.Mode=Internal
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
VP_TIM3_VS_ClockSourceINT.Mode=Internal
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
board=custom
